In [1]:
%matplotlib inline

In [ ]:
# Basic Clustering Example using discrete variables

As we observe, user A and user B match on 3 friends, Jorge, Jos√©, and Juan, while user C only matches Roberto with B. Therefore we should try to find a way of clustering A and B in one group, since they have more matches in common

In [26]:
from sklearn.cluster import KMeans
import pandas as pd

# in theory A and B should share the same cluster, and C should be another
data = pd.read_csv("h:\\documents\\clustering_data_test.csv")
data.head(20)

   user     friend
0     A      jorge
1     A       juan
2     A       jose
3     A    alberto
4     B    roberto
5     B      jorge
6     B       juan
7     B       jose
8     C    roberto
9     C     olivia
10    C  florencia
11    C     denise
12    C      paula

In [27]:
# prepare arrays
datap = data
datap["count"] = 1
datap = pd.DataFrame(datap.pivot_table(index=["user"], columns=["friend"]).to_records())
datap.fillna(0, inplace=True)
datam = datap.iloc[:,1:].as_matrix()

In [28]:
datam

array([[ 1.,  0.,  0.,  1.,  1.,  1.,  0.,  0.,  0.],
       [ 0.,  0.,  0.,  1.,  1.,  1.,  0.,  0.,  1.],
       [ 0.,  1.,  1.,  0.,  0.,  0.,  1.,  1.,  1.]])

In [29]:
kmeans = KMeans(n_clusters=2, random_state=0).fit(datam)

In [30]:
kmeans.labels_

array([0, 0, 1])

In [32]:
datap["cluster"] = kmeans.labels_

In [33]:
datap

,user,"('count', 'alberto')","('count', 'denise')","('count', 'florencia')","('count', 'jorge')","('count', 'jose')","('count', 'juan')","('count', 'olivia')","('count', 'paula')","('count', 'roberto')",cluster
0,A,1.0,0.0,0.0,1.0,1.0,1.0,0.0,0.0,0.0,0
1,B,0.0,0.0,0.0,1.0,1.0,1.0,0.0,0.0,1.0,0
2,C,0.0,1.0,1.0,0.0,0.0,0.0,1.0,1.0,1.0,1